

    CreateQuestBJ( bj_QUESTTYPE_REQ_DISCOVERED, "综合", "作者:最萌小汐\n\
原案:￠月下の风§\n\
触发:乱入魔人(诈尸中)\n\
策划:御坂19209\n\
模型:空灵之境 黑键\n\
音效:三叶星期\n\
苦力:村姐姐 近卫紫 高桥宗介(已经阵亡)\n\
地形:冥子\n\
感谢内测群里的朋友大力支持 帮助地图发展\n\
QQ群:电信27916644 网通71619761\n\
YY:149571\n\
11对战平台-RPG万人房\n\
感谢以下团体的协助:\n\
暴雪娱乐/百度-魔兽地图编辑器吧/月协YDWE/THD制作团/11对战平台", "ReplaceableTextures\\CommandButtons\\BTNAmbush.blp" )


    CreateQuestBJ( bj_QUESTTYPE_REQ_DISCOVERED, "模型来源", "以下模型部分或者全部使用了其他人制作的模型：\n\
奥雷欧斯/建宫斋字/一方通行/宗教狂热者/猎犬部队/战斗法师:韩国魔禁图\n\
黑白子/女仆:东方轮舞祭(雾雨魔理沙)\n\
削板军霸:火影忍者(漩涡鸣人)\n\
结标淡希/御坂妹妹/御坂美琴:不明(御坂美琴)\n\
三千院/第二王女:不明(春日野穹)\n\
绢旗最爱:东方幻想乡(二小姐)\n\
黑羽月凤/姬神沙秋:信长之野望\n\
茵蒂克丝:不明(桃子)\n\
神裂火织:cytwscyt\n\
前方之风:kiss草帽\n\
土御门元春/麦野沈利/白井黑子:久远寺凛\n\
五和/Y叔城堡等:不明\n\
筒隐月子:柳生先生\n\
Saber lily:Jump大赛/传说中の傻子/TJ\n\
部分模型由于网络打包下载或者年代久远出处不明,希望作者看到后能和我们联系,我们会补上模型信息", "ReplaceableTextures\\CommandButtons\\BTNAmbush.blp" )


