

    CreateQuestBJ( bj_QUESTTYPE_REQ_DISCOVERED, "综合", "作者:最萌小汐\n\
原案:￠月下の风§\n\
触发:乱入魔人(诈尸中)\n\
策划:御坂19209\n\
模型:空灵之境 黑键\n\
音效:三叶星期\n\
苦力:村姐姐 近卫紫 高桥宗介(已经阵亡)\n\
地形:冥子\n\
感谢内测群里的朋友大力支持 帮助地图发展\n\
QQ群:电信27916644 网通71619761\n\
YY:149571\n\
11对战平台-RPG万人房\n\
感谢以下团体的协助:\n\
暴雪娱乐/百度-魔兽地图编辑器吧/月协YDWE/THD制作团/11对战平台", "ReplaceableTextures\\CommandButtons\\BTNAmbush.blp" )


    CreateQuestBJ( bj_QUESTTYPE_REQ_DISCOVERED, "模型来源", "以下模型部分或者全部使用了其他人制作的模型：\n\
奥雷欧斯/建宫斋字/一方通行/宗教狂热者/猎犬部队/战斗法师:韩国魔禁图\n\
黑白子/女仆:东方轮舞祭(雾雨魔理沙)\n\
削板军霸:火影忍者(漩涡鸣人)\n\
结标淡希/御坂妹妹/御坂美琴:不明(御坂美琴)\n\
三千院/第二王女:不明(春日野穹)\n\
绢旗最爱:东方幻想乡(二小姐)\n\
黑羽月凤/姬神沙秋:信长之野望\n\
茵蒂克丝:不明(桃子)\n\
神裂火织:cytwscyt\n\
前方之风:kiss草帽\n\
土御门元春/麦野沈利/白井黑子:久远寺凛\n\
五和/Y叔城堡等:不明\n\
筒隐月子:柳生先生\n\
部分模型由于网络打包下载或者年代久远出处不明,希望作者看到后能和我们联系,我们会补上模型信息", "ReplaceableTextures\\CommandButtons\\BTNAmbush.blp" )


    CreateQuestBJ( bj_QUESTTYPE_REQ_DISCOVERED, "BUG", "英雄被卡住可以尝试输入“解除卡死”脱离\n\
如果发现任何BUG或对地图有其他意见，可以到百度“魔法科学大混战”吧－置顶帖汇报\n\
http://tieba.baidu.com/f?kz=815268717\n\
或者到QQ群27916644汇报，谢谢", "ReplaceableTextures\\CommandButtons\\BTNAmbush.blp" )


    CreateQuestBJ( bj_QUESTTYPE_OPT_DISCOVERED, "推荐模式", "-AINT 单机打AI(AI模式/禁止发兵)\n\
-ADSP 路人局(全体征召/洗牌)\n\
-SS   OMG(自选技能)\n\
-CUCS 娱乐(随机英雄/随机技能/死后随机换英雄和技能)\n\
-RCUM 娱乐(无CD/无耗蓝)\n\
\n\
更多模式请参见贴吧或论坛", "ReplaceableTextures\\CommandButtons\\BTNAmbush.blp" )
    
    
    CreateQuestBJ( bj_QUESTTYPE_OPT_DISCOVERED, "新手提示", "1.女仆系统。该地图中女仆拥有大量给力的能力，可以说不会使用女仆，几乎很难获得胜利，常用效果有，出兵，使用战略武器，储存物品，空投物品，托管药物道具，使用药物道具，生命魔法转换等功能。建议新人多多熟悉女仆的所有技能效果。\n\
2.称号系统。在游戏中，当你达到获得称号的条件时，会自动获得称号，系统将会有文字提示，此时输入-CH，你就可以看到自己目前所拥有的称号，并可以进一步输入-CH *** 指令来看称号效果，输入-CH *** 1（***为称号名，1为数字1。\n\
中间的空格必须有）可以将指定称号装备，装备可以同时有多个，但只有装备的称号才会有效果。一般，只能装备一个称号。输入-CH *** 0可以取消当前装备的称号。\n\
有些称号在效果完成后，会被收回。\n\
学会使用称号，可以让你获得许多帮助，使你更难被杀，和更好的获得金钱等奖励，以及更好的欺负你的对手。\n\
3.涡点。该图中，根据原著，设计的独特系统。在地图上特定的位置分布着一些涡点，涡点每间隔一定时间开放，当你处于涡点附近时，按键盘的方向键，可以传送至另外一个指定方向的涡点，按ESC键则可以回到泉水，不过需要3秒施法时间。\n\
灵活运用涡点，可以让你很好的逃跑，提高GANK成功率，增加机动性，缩短回程时间。\n\
4.不要轻易的认定某个英雄变态或强或弱，该图虽然英雄尚不完善，平衡还不够好，但大多数英雄都是各有特色的强，所以不要轻易觉得某某变态，某某太弱，另外装备合成问题，其实多看看别人怎么出装备就好，一般力量智力敏捷出装都是比较共通的，力量大多出哪几样好，敏捷出哪几样好，智力出哪几样好，多象会玩的人学习，须知这里成长出来的触手可是很多的说。\n\
最后发现BUG或文字描述错误的地方 请和作者联系。", "ReplaceableTextures\\CommandButtons\\BTNAmbush.blp" )


    CreateQuestBJ( bj_QUESTTYPE_OPT_DISCOVERED, "制作团队招募", "目前地图制作严重缺人\n\
如果你擅长触发编辑/地形制作/模型制作/美工/设计且对魔禁有爱,我们随时恭候您的加盟!", "ReplaceableTextures\\CommandButtons\\BTNAmbush.blp" )

